andreili/STM32FX_FM/inc/stm32_hcd.h
#ifndef __STM32_HCD_H__
#define __STM32_HCD_H__

/*
 * Based on HAL-F4 v1.21.0
 * */

#include "stm32_inc.h"

enum class EOTGDeviceMode
{
    DEVICE = 0,
    HOST = 1,
    DRD = 2,
};

enum class EURBState
{
    IDLE = 0,
    DONE,
    NOT_READY,
    NYET,
    ERROR,
    STALL,
};

enum class EHCState
{
    IDLE = 0,
    XFRC,
    HALTED,
    NAK,
    NYET,
    STALL,
    XACTERR,
    BBLERR,
    DATATGLERR,
};

enum class EOTGSpeed
{
    HIGH = 0,
    HIGH_IN_FULL = 1,
    LOW = 2,
    FULL = 3,
};

enum class EOTG_PHY
{
    ULPI = 1,
    EMBEDDED = 2,
};

#define USB_OTG_HS_MAX_PACKET_SIZE           512U
#define USB_OTG_FS_MAX_PACKET_SIZE           64U
#define USB_OTG_MAX_EP0_SIZE                 64U

#define DSTS_ENUMSPD_HS_PHY_30MHZ_OR_60MHZ     (0U << 1U)
#define DSTS_ENUMSPD_FS_PHY_30MHZ_OR_60MHZ     (1U << 1U)
#define DSTS_ENUMSPD_LS_PHY_6MHZ               (2U << 1U)
#define DSTS_ENUMSPD_FS_PHY_48MHZ              (3U << 1U)

#define DCFG_FRAME_INTERVAL_80                 0U
#define DCFG_FRAME_INTERVAL_85                 1U
#define DCFG_FRAME_INTERVAL_90                 2U
#define DCFG_FRAME_INTERVAL_95                 3U

#define DEP0CTL_MPS_64                         0U
#define DEP0CTL_MPS_32                         1U
#define DEP0CTL_MPS_16                         2U
#define DEP0CTL_MPS_8                          3U

#define EP_SPEED_LOW                           0U
#define EP_SPEED_FULL                          1U
#define EP_SPEED_HIGH                          2U

enum class EEPType
{
    CTRL = 0,
    ISOC,
    BULK,
    INTR,
    MSK,
};

#define STS_GOUT_NAK                           1U
#define STS_DATA_UPDT                          2U
#define STS_XFER_COMP                          3U
#define STS_SETUP_COMP                         4U
#define STS_SETUP_UPDT                         6U

enum class EClockSpeed
{
    _30_60_MHZ = 0,
    _48_MHZ,
    _6_MHZ,
};

#define HPRT0_PRTSPD_HIGH_SPEED                0U
#define HPRT0_PRTSPD_FULL_SPEED                1U
#define HPRT0_PRTSPD_LOW_SPEED                 2U

#define HCCHAR_CTRL                            (0U << USB_OTG_HCCHAR_EPTYP_Pos)
#define HCCHAR_ISOC                            (1U << USB_OTG_HCCHAR_EPTYP_Pos)
#define HCCHAR_BULK                            (2U << USB_OTG_HCCHAR_EPTYP_Pos)
#define HCCHAR_INTR                            (3U << USB_OTG_HCCHAR_EPTYP_Pos)

#define HC_PID_DATA0                           0U
#define HC_PID_DATA2                           1U
#define HC_PID_DATA1                           2U
#define HC_PID_SETUP                           3U

#define GRXSTS_PKTSTS_IN                       2U
#define GRXSTS_PKTSTS_IN_XFER_COMP             3U
#define GRXSTS_PKTSTS_DATA_TOGGLE_ERR          5U
#define GRXSTS_PKTSTS_CH_HALTED                7U

#define USB_IN_EP_COUNT ((USB_OTG_OUT_ENDPOINT_BASE - USB_OTG_IN_ENDPOINT_BASE) / USB_OTG_EP_REG_SIZE)
#define USB_OUT_EP_COUNT ((USB_OTG_PCGCCTL_BASE - USB_OTG_OUT_ENDPOINT_BASE) / USB_OTG_EP_REG_SIZE)
#define USB_HOST_PORTS_COUNT ((USB_OTG_HOST_CHANNEL_BASE - USB_OTG_HOST_PORT_BASE) / sizeof(uint32_t))
#define USB_HOST_CHANNELS_COUNT ((USB_OTG_DEVICE_BASE - USB_OTG_HOST_CHANNEL_BASE) / USB_OTG_HOST_CHANNEL_SIZE)
#define USB_PCGCCTL_COUNT ((USB_OTG_FIFO_BASE - USB_OTG_PCGCCTL_BASE) / sizeof(uint32_t))
#define USB_DFIFO_COUNT (USB_OTG_FIFO_SIZE / sizeof(uint32_t))

enum class EHCDState
{
    RESET_ = 0,
    READY,
    ERROR,
    BUSY,
    TIMEOUT,
};

typedef struct
{
    USB_OTG_GlobalTypeDef       global;
    uint32_t                    HPRT0;
    USB_OTG_HostTypeDef         host;
    uint32_t                    ports[USB_HOST_PORTS_COUNT];
    USB_OTG_HostChannelTypeDef  channels[USB_HOST_CHANNELS_COUNT];
    USB_OTG_DeviceTypeDef       device;
    USB_OTG_INEndpointTypeDef   in_eps[USB_IN_EP_COUNT];
    USB_OTG_OUTEndpointTypeDef  out_eps[USB_OUT_EP_COUNT];
    uint32_t                    PCGCCTL[USB_PCGCCTL_COUNT];
    uint32_t                    DFIFO[USB_DFIFO_COUNT];
} OTGRegs_t;

typedef struct
{
  uint8_t   dev_addr ;     /*!< USB device address.
                                This parameter must be a number between Min_Data = 1 and Max_Data = 255    */
  uint8_t   ch_num;        /*!< Host channel number.
                                This parameter must be a number between Min_Data = 1 and Max_Data = 15     */
  uint8_t   ep_num;        /*!< Endpoint number.
                                This parameter must be a number between Min_Data = 1 and Max_Data = 15     */
  bool      ep_is_in;      /*!< Endpoint direction
                                This parameter must be a number between Min_Data = 0 and Max_Data = 1      */
  EOTGSpeed speed;         /*!< USB Host speed.
                                This parameter can be any value of @ref USB_Core_Speed_                    */
  bool      do_ping;       /*!< Enable or disable the use of the PING protocol for HS mode.                */
  uint8_t   process_ping;  /*!< Execute the PING protocol for HS mode.                                     */
  EEPType   ep_type;       /*!< Endpoint Type.
                                This parameter can be any value of @ref USB_EP_Type_                       */
  uint16_t  max_packet;    /*!< Endpoint Max packet size.
                                This parameter must be a number between Min_Data = 0 and Max_Data = 64KB   */
  uint8_t   data_pid;      /*!< Initial data PID.
                                This parameter must be a number between Min_Data = 0 and Max_Data = 1      */
  uint8_t   *xfer_buff;    /*!< Pointer to transfer buffer.                                                */
  uint32_t  xfer_len;      /*!< Current transfer length.                                                   */
  uint32_t  xfer_count;    /*!< Partial transfer length in case of multi packet transfer.                  */
  uint8_t   toggle_in;     /*!< IN transfer current toggle flag.
                                This parameter must be a number between Min_Data = 0 and Max_Data = 1      */
  bool      toggle_out;    /*!< OUT transfer current toggle flag
                                This parameter must be a number between Min_Data = 0 and Max_Data = 1      */
  uint32_t  dma_addr;      /*!< 32 bits aligned transfer buffer address.                                   */
  uint32_t  ErrCnt;        /*!< Host channel error count.*/
  EURBState urb_state;     /*!< URB state.
                                This parameter can be any value of @ref USB_OTG_URBStateTypeDef            */
  EHCState  state;         /*!< Host Channel state.
                                This parameter can be any value of @ref USB_OTG_HCStateTypeDef             */
} OTG_HC_t;

#define TX_FIFO_COUNT 0x10

#define deactivate_dedicated_endpoint deactivate_endpoint

