andreili/STM32FX_FM/inc/stm32_hcd.h
class STM32_HCD
{
public:
    uint32_t init(USB_OTG_GlobalTypeDef *regs_addr, EOTG_PHY phy, bool use_ext_vbus, bool dma_enable, EOTGSpeed speed, uint32_t host_channels);
    void deInit();

    inline void enable() { enable_global_int(); }
    inline void disable() { disable_global_int(); }

    inline uint32_t get_flag(uint32_t mask) { return (read_IT() & mask) == mask; }
    inline void clear_flag(uint32_t mask) { m_regs->global.GINTSTS = mask; }
    inline bool is_invalid_IT() { return (read_IT() == 0); }

    inline bool is_HC_int(uint8_t ch_num, uint32_t mask) { return (m_regs->channels[ch_num].HCINT & mask) == mask; }
    inline void clear_HC_int(uint8_t ch_num, uint32_t mask) { m_regs->channels[ch_num].HCINT = mask; }
    inline void set_HC_int(uint8_t ch_num, uint32_t val) { m_regs->channels[ch_num].HCINTMSK = val; }
    inline void mask_HC_int(uint8_t ch_num, uint32_t mask) { m_regs->channels[ch_num].HCINTMSK &= ~mask; }
    inline void unmask_HC_int(uint8_t ch_num, uint32_t mask) { m_regs->channels[ch_num].HCINTMSK |= mask; }
    inline void mask_halt_HC_int(uint8_t ch_num) { m_regs->channels[ch_num].HCINTMSK &= ~USB_OTG_HCINTMSK_CHHM; }
    inline void mask_all_HC_int(uint8_t ch_num) { m_regs->channels[ch_num].HCINTMSK = 0; }
    inline void unmask_halt_HC_int(uint8_t ch_num) { m_regs->channels[ch_num].HCINTMSK |= USB_OTG_HCINTMSK_CHHM; }
    inline void mask_ack_HC_int(uint8_t ch_num) { m_regs->channels[ch_num].HCINTMSK &= ~USB_OTG_HCINTMSK_ACKM; }
    inline void unmask_ack_HC_int(uint8_t ch_num) { m_regs->channels[ch_num].HCINTMSK |= USB_OTG_HCINTMSK_ACKM; }

    inline void mask_IT(uint32_t mask) { m_regs->global.GINTMSK &= ~mask; }
    inline void unmask_IT(uint32_t mask) { m_regs->global.GINTMSK |= mask; }

    inline void clear_in_ep_intr(uint8_t ep_num, uint32_t mask) { m_regs->in_eps[ep_num].DIEPINT = mask; }
    inline void clear_out_ep_intr(uint8_t ep_num, uint32_t mask) { m_regs->out_eps[ep_num].DOEPINT = mask; }

    inline uint32_t get_current_frame() { return (m_regs->host.HFNUM & USB_OTG_HFNUM_FRNUM); }
    inline EOTGSpeed get_current_speed() { return get_host_speed(); }

    void set_toggle(uint8_t pipe, uint8_t toggle);
    uint8_t get_toggle(uint8_t pipe);

    void reset_port();
    inline void reset_port_LL() { m_regs->HPRT0 &= ~(USB_OTG_HPRT_PENA | USB_OTG_HPRT_PCDET | USB_OTG_HPRT_PENCHNG | USB_OTG_HPRT_POCCHNG); }
    inline void reset_port_st1(uint32_t val) { m_regs->HPRT0 = val; }
    uint32_t start();
    uint32_t stop();

    inline EHCDState get_state() { return m_state; }

    inline void enable_host_IT(uint8_t ch_num) { m_regs->host.HAINTMSK |= (1 << ch_num); }
    inline void set_host_IT(uint32_t val) { m_regs->host.HAINT = val; }

    uint32_t HC_init(uint8_t ch_num, uint8_t ep_num, uint8_t dev_address, EOTGSpeed speed, EEPType ep_type, uint16_t mps);
    inline void HC_set_params(uint8_t ch_num, uint8_t ep_num, uint8_t dev_address, EOTGSpeed speed, EEPType ep_type, uint16_t mps)
        {
            m_regs->channels[ch_num].HCCHAR = ((dev_address << USB_OTG_HCCHAR_DAD_Pos) & USB_OTG_HCCHAR_DAD) |
                    (((ep_num & 0x7f) << USB_OTG_HCCHAR_EPNUM_Pos) & USB_OTG_HCCHAR_EPNUM) |
                    ((((ep_num & 0x80) == 0x80) << USB_OTG_HCCHAR_EPDIR_Pos) & USB_OTG_HCCHAR_EPDIR) |
                    (((speed == EOTGSpeed::LOW) << USB_OTG_HCCHAR_LSDEV_Pos) & USB_OTG_HCCHAR_LSDEV) |
                    (((uint32_t)ep_type << USB_OTG_HCCHAR_EPTYP_Pos) & USB_OTG_HCCHAR_EPTYP) |
                    (mps & USB_OTG_HCCHAR_MPSIZ);
        }
    inline bool HC_get_dir(uint8_t ch_num) { return ((m_regs->channels[ch_num].HCCHAR & USB_OTG_HCCHAR_EPDIR) == USB_OTG_HCCHAR_EPDIR); }
    inline uint32_t HC_get_params(uint8_t ch_num) { return m_regs->channels[ch_num].HCCHAR; }
    inline void HC_set_param_RAW(uint8_t ch_num, uint32_t val) { m_regs->channels[ch_num].HCCHAR = val; }
    inline void HC_enable_param(uint8_t ch_num, uint32_t mask) { m_regs->channels[ch_num].HCCHAR |= mask; }
    inline void HC_disable_param(uint8_t ch_num, uint32_t mask) { m_regs->channels[ch_num].HCCHAR &= ~mask; }
    void HC_submit_request(uint8_t ch_num, bool is_in, EEPType ep_type, bool token, uint8_t* pbuff, uint16_t length, bool do_ping);
    uint32_t HC_halt(uint8_t hc_num);
    inline uint32_t HC_get_Xfer_count(uint8_t chnum) { return m_HC[chnum].xfer_count; }
    inline EURBState HC_get_URB_state(uint8_t chnum) { return m_HC[chnum].urb_state; }
    inline EHCState HC_get_state(uint8_t chnum) { return m_HC[chnum].state; }

    void IRQ_handler();
private:
    OTGRegs_t*  m_regs;
    OTG_HC_t    m_HC[15];
    uint32_t    m_lock;
    EHCDState   m_state;
    void*       m_data;
    bool        m_dma_enable;
    uint32_t    m_host_channels;
    EOTG_PHY    m_phy;
    EOTGSpeed   m_speed;

    void init_gpio();
    void deInit_gpio();

    uint32_t core_init(EOTG_PHY phy, bool use_ext_vbus, bool dma_enable);
    inline void power_down() { m_regs->global.GCCFG &= ~USB_OTG_GCCFG_PWRDWN; }
    inline void power_up() { m_regs->global.GCCFG = USB_OTG_GCCFG_PWRDWN; }
    inline void init_phy_ULPI() { m_regs->global.GCCFG &= ~(USB_OTG_GUSBCFG_TSDPS | USB_OTG_GUSBCFG_ULPIFSLS | USB_OTG_GUSBCFG_PHYSEL); }
    inline void init_phy_embedded() { m_regs->global.GUSBCFG |= USB_OTG_GUSBCFG_PHYSEL; }
    inline void reset_ULPI_VBUS() { m_regs->global.GUSBCFG &= ~(USB_OTG_GUSBCFG_ULPIEVBUSD | USB_OTG_GUSBCFG_ULPIEVBUSI); }
    inline void set_ULPI_VBUS() { m_regs->global.GUSBCFG |= USB_OTG_GUSBCFG_ULPIEVBUSD; }
    inline void enable_DMA() { m_regs->global.GAHBCFG |= (USB_OTG_GAHBCFG_HBSTLEN_2 | USB_OTG_GAHBCFG_DMAEN); }
    void dev_init(bool vbus_sending_enable, EOTG_PHY phy, EOTGSpeed speed, uint32_t ep_count, bool dma_enable, bool sof_enable);
    ENDIS_REG_FLAG_NAME(VBUS_A, m_regs->global.GCCFG, USB_OTG_GCCFG_VBUSASEN)
    ENDIS_REG_FLAG_NAME(VBUS_B, m_regs->global.GCCFG, USB_OTG_GCCFG_VBUSBSEN)
    ENDIS_REG_FLAG_NAME(VBUS, m_regs->global.GCCFG, USB_OTG_GCCFG_NOVBUSSENS)
    inline void restart_phy_clock() { m_regs->PCGCCTL[0] = 0; }
    inline void mode_device_configuration() { m_regs->device.DCFG |= DCFG_FRAME_INTERVAL_80; }
    inline void clear_all_ITs() { clear_in_IT();       clear_out_IT();
                                  clear_shared_IT();   m_regs->device.DAINTMSK = 0; }
    inline bool is_in_endpoint_enable(uint32_t ep_idx) { return (m_regs->in_eps[ep_idx].DIEPCTL & USB_OTG_DIEPCTL_EPENA) == USB_OTG_DIEPCTL_EPENA; }
    inline void disable_NAK_in_endpoint(uint32_t ep_idx) { m_regs->in_eps[ep_idx].DIEPCTL = (USB_OTG_DIEPCTL_EPDIS | USB_OTG_DIEPCTL_SNAK); }
    inline void disable_in_endpoint(uint32_t ep_idx) { m_regs->in_eps[ep_idx].DIEPCTL = 0; }
    inline void in_endpoint_reset_Xfer_size(uint32_t ep_idx) { m_regs->in_eps[ep_idx].DIEPTSIZ = 0; }
    inline void in_endpoint_reset_IT(uint32_t ep_idx) { m_regs->in_eps[ep_idx].DIEPINT = 0xff; }
    inline bool is_out_endpoint_enable(uint32_t ep_idx) { return (m_regs->out_eps[ep_idx].DOEPCTL & USB_OTG_DOEPCTL_EPENA) == USB_OTG_DOEPCTL_EPENA; }
    inline void disable_NAK_out_endpoint(uint32_t ep_idx) { m_regs->out_eps[ep_idx].DOEPCTL = (USB_OTG_DOEPCTL_EPDIS | USB_OTG_DOEPCTL_SNAK); }
    inline void disable_out_endpoint(uint32_t ep_idx) { m_regs->out_eps[ep_idx].DOEPCTL = 0; }
    inline void out_endpoint_reset_Xfer_size(uint32_t ep_idx) { m_regs->out_eps[ep_idx].DOEPTSIZ = 0; }
    inline void out_endpoint_reset_IT(uint32_t ep_idx) { m_regs->out_eps[ep_idx].DOEPINT = 0xff; }
    inline void reset_FIFO_underrun_flag() { m_regs->device.DIEPMSK &= ~USB_OTG_DIEPMSK_TXFURM; }
    inline void set_DMA_thresshold() {  m_regs->device.DTHRCTL = (USB_OTG_DTHRCTL_TXTHRLEN_6 | USB_OTG_DTHRCTL_RXTHRLEN_6 |
                                                                  USB_OTG_DTHRCTL_RXTHREN | USB_OTG_DTHRCTL_ISOTHREN | USB_OTG_DTHRCTL_NONISOTHREN);
                                        __IO uint32_t tmp = m_regs->device.DTHRCTL;
                                        UNUSED(tmp);
                                     }
    inline void disable_all_IT() { m_regs->global.GINTMSK = 0; }
    inline void clear_all_IT() { m_regs->global.GINTSTS = 0xbfffffff; }
    inline void clear_all_IT1() { m_regs->global.GINTSTS = 0xffffffff; }
    inline void enable_IT(uint32_t mask) { m_regs->global.GINTMSK |= mask; }

