andreili/STM32FX_FM/inc/stm32_hcd.h
    inline void enable_global_int() { m_regs->global.GAHBCFG |= USB_OTG_GAHBCFG_GINT; }
    inline void disable_global_int() { m_regs->global.GAHBCFG &= ~USB_OTG_GAHBCFG_GINT; }

    void set_current_mode(EOTGDeviceMode mode);
    inline void reset_mode() { m_regs->global.GUSBCFG &= ~(USB_OTG_GUSBCFG_FHMOD | USB_OTG_GUSBCFG_FDMOD); }
    inline void set_mode_host() { m_regs->global.GUSBCFG |= USB_OTG_GUSBCFG_FHMOD; }
    inline void set_mode_device() { m_regs->global.GUSBCFG |= USB_OTG_GUSBCFG_FDMOD; }

    inline void set_dev_speed(EOTGSpeed speed) { m_regs->device.DCFG |= (uint32_t)speed; }
    inline uint32_t get_dev_speed_RAW() { return (m_regs->device.DSTS & USB_OTG_DSTS_ENUMSPD); }
    EOTGSpeed get_dev_speed();

    uint32_t flush_RX_FIFO();
    uint32_t flush_TX_FIFO(uint32_t num);

    inline bool is_frame_odd() { return (m_regs->device.DSTS & (1 << USB_OTG_DSTS_FNSOF_Pos)) == 0; }

    void activate_endpoint(bool ep_is_in, uint8_t ep_num, uint32_t ep_maxpacket, uint8_t ep_type);
    uint32_t deactivate_endpoint(bool ep_is_in, uint8_t ep_num);
    void activate_dedicated_endpoint(bool ep_is_in, uint8_t ep_num, uint32_t ep_maxpacket, uint8_t ep_type);

    inline void set_ep_IT_mask(uint32_t mask) { m_regs->device.DAINTMSK |= mask; }
    inline void clear_ep_IT_mask(uint32_t mask) { m_regs->device.DAINTMSK &= ~mask; }

    inline bool is_ep_in_active(uint8_t ep_num) { return (m_regs->in_eps[ep_num].DIEPCTL & USB_OTG_DIEPCTL_USBAEP) == 0; }
    inline void deactivate_ep_in(uint8_t ep_num) { m_regs->in_eps[ep_num].DIEPCTL &= ~USB_OTG_DIEPCTL_USBAEP; }
    inline void set_NAK_ep_in(uint8_t ep_num) { m_regs->in_eps[ep_num].DIEPCTL = USB_OTG_DIEPCTL_SNAK; }
    inline bool is_ep_in_disabled(uint8_t ep_num) { return (m_regs->in_eps[ep_num].DIEPINT & USB_OTG_DIEPCTL_EPDIS) == USB_OTG_DIEPCTL_EPDIS; }
    inline void disable_ep_in(uint8_t ep_num) { m_regs->in_eps[ep_num].DIEPCTL = USB_OTG_DIEPCTL_EPDIS; }
    inline void undisable_ep_in(uint8_t ep_num) { m_regs->in_eps[ep_num].DIEPCTL &= ~USB_OTG_DIEPCTL_EPDIS; }
    inline void activate_ep_in(uint8_t ep_num, uint32_t ep_maxpacket, uint8_t ep_type)
        { m_regs->in_eps[ep_num].DIEPCTL |= (ep_maxpacket & USB_OTG_DIEPCTL_MPSIZ) |
                                            (ep_type << 18) | (ep_num << 22) |
                                            USB_OTG_DIEPCTL_SD0PID_SEVNFRM | USB_OTG_DIEPCTL_USBAEP; }

    inline bool is_ep_out_active(uint8_t ep_num) { return (m_regs->out_eps[ep_num].DOEPCTL & USB_OTG_DOEPCTL_USBAEP) == 0; }
    inline void deactivate_ep_out(uint8_t ep_num) { m_regs->out_eps[ep_num].DOEPCTL &= ~USB_OTG_DOEPCTL_USBAEP; }
    inline void set_NAK_ep_out(uint8_t ep_num) { m_regs->out_eps[ep_num].DOEPCTL = USB_OTG_DOEPCTL_SNAK; }
    inline bool is_ep_out_disabled(uint8_t ep_num) { return (m_regs->out_eps[ep_num].DOEPINT & USB_OTG_DOEPINT_OTEPDIS) == USB_OTG_DOEPINT_OTEPDIS; }
    inline void disable_ep_out(uint8_t ep_num) { m_regs->out_eps[ep_num].DOEPCTL = USB_OTG_DOEPCTL_EPDIS; }
    inline void undisable_ep_out(uint8_t ep_num) { m_regs->out_eps[ep_num].DOEPCTL &= ~USB_OTG_DOEPCTL_EPDIS; }
    inline void clear_global_NAK() { m_regs->device.DCTL |= USB_OTG_DCTL_CGONAK; }
    inline void activate_ep_out(uint8_t ep_num, uint32_t ep_maxpacket, uint8_t ep_type)
        { m_regs->out_eps[ep_num].DOEPCTL |= (ep_maxpacket & USB_OTG_DOEPCTL_MPSIZ) |
                                             (ep_type << 18) | (ep_num << 22) |
                                             USB_OTG_DIEPCTL_SD0PID_SEVNFRM | USB_OTG_DOEPCTL_USBAEP; }

    void EP_start_Xfer(bool ep_is_in, uint8_t ep_num, uint32_t ep_maxpacket,
                       uint8_t* xfer_buff, uint16_t xfer_len, EEPType ep_type,
                       bool dma, uint32_t dma_addr);
    void EP0_start_Xfer(bool ep_is_in, uint8_t ep_num, uint32_t ep_maxpacket,
                        uint8_t* xfer_buff, uint16_t xfer_len, EEPType ep_type,
                        bool dma, uint32_t dma_addr);
    inline void set_dev_empty_mask(uint32_t ep_num) { m_regs->device.DIEPEMPMSK |= (1 << ep_num); }

    inline void Xfer_in_pkt_start(uint8_t ep_num)
        {
            m_regs->in_eps[ep_num].DIEPTSIZ &= ~USB_OTG_DIEPTSIZ_XFRSIZ;
            m_regs->in_eps[ep_num].DIEPTSIZ &= ~USB_OTG_DIEPTSIZ_PKTCNT;
        }
    inline void Xfer_in_pkt_size(uint8_t ep_num, uint32_t len) {  m_regs->in_eps[ep_num].DIEPTSIZ |= (USB_OTG_DIEPTSIZ_PKTCNT & (len << 19)); }
    inline void Xfer_in_pkt_end(uint8_t ep_num, uint32_t len) { m_regs->in_eps[ep_num].DIEPTSIZ |= (USB_OTG_DIEPTSIZ_XFRSIZ & len); }
    inline void Xfer_in_pkt_multi(uint8_t ep_num)
        {
            m_regs->in_eps[ep_num].DIEPTSIZ &= ~USB_OTG_DIEPTSIZ_MULCNT;
            m_regs->in_eps[ep_num].DIEPTSIZ |= (USB_OTG_DIEPTSIZ_MULCNT & (1 <USB_OTG_DIEPTSIZ_MULCNT_Pos));
        }
    inline void Xfer_in_enable_DMA(uint8_t ep_num, uint32_t dma_addr) { m_regs->in_eps[ep_num].DIEPDMA = dma_addr; }
    inline void Xfer_in_set_odd_frame(uint8_t ep_num) { m_regs->in_eps[ep_num].DIEPCTL |= USB_OTG_DIEPCTL_SODDFRM; }
    inline void Xfer_in_set_data0_pid(uint8_t ep_num) { m_regs->in_eps[ep_num].DIEPCTL |= USB_OTG_DIEPCTL_SD0PID_SEVNFRM; }
    inline void Xfer_in_ep_enable(uint8_t ep_num) { m_regs->in_eps[ep_num].DIEPCTL |= (USB_OTG_DIEPCTL_CNAK | USB_OTG_DIEPCTL_EPENA); }

    inline void Xfer_out_pkt_start(uint8_t ep_num)
        {
            m_regs->out_eps[ep_num].DOEPTSIZ &= ~USB_OTG_DIEPTSIZ_XFRSIZ;
            m_regs->out_eps[ep_num].DOEPTSIZ &= ~USB_OTG_DOEPTSIZ_PKTCNT;
        }
    inline void Xfer_out_pkt_size(uint8_t ep_num, uint32_t len) { m_regs->out_eps[ep_num].DOEPTSIZ |= (USB_OTG_DOEPTSIZ_PKTCNT & (len << 19)); }
    inline void Xfer_out_pkt_end(uint8_t ep_num, uint32_t len) { m_regs->out_eps[ep_num].DOEPTSIZ |= (USB_OTG_DOEPTSIZ_XFRSIZ & len); }
    inline void Xfer_out_enable_DMA(uint8_t ep_num, uint32_t dma_addr) { m_regs->out_eps[ep_num].DOEPDMA = dma_addr; }
    inline void Xfer_out_set_odd_frame(uint8_t ep_num) { m_regs->out_eps[ep_num].DOEPCTL |= USB_OTG_DOEPCTL_SODDFRM; }
    inline void Xfer_out_set_data0_pid(uint8_t ep_num) { m_regs->out_eps[ep_num].DOEPCTL |= USB_OTG_DOEPCTL_SD0PID_SEVNFRM; }
    inline void Xfer_out_ep_enable(uint8_t ep_num) { m_regs->out_eps[ep_num].DOEPCTL |= (USB_OTG_DOEPCTL_CNAK | USB_OTG_DOEPCTL_EPENA); }

    void write_packet(uint8_t* src, uint8_t ch_ep_num, uint16_t len, uint8_t dma);
    void* read_packet(uint8_t* dest, uint16_t len);
    inline void write_FIFO(uint8_t cp_ep_num, uint32_t data) { m_regs->DFIFO[cp_ep_num] = data; }
    inline uint32_t read_FIFO(uint8_t cp_ep_num) { return m_regs->DFIFO[cp_ep_num]; }

