andreili/STM32FX_FM/inc/stm32_hcd.h
    void EP_set_stall(bool ep_is_in, uint8_t ep_num);
    void EP_clear_stall(bool ep_is_in, uint8_t ep_num, EEPType ep_type);
    inline void ep_in_set_stall(uint8_t ep_num) { m_regs->in_eps[ep_num].DIEPCTL |= USB_OTG_DIEPCTL_STALL; }
    inline void ep_in_clear_stall(uint8_t ep_num) { m_regs->in_eps[ep_num].DIEPCTL &= ~USB_OTG_DIEPCTL_STALL; }
    inline void ep_out_set_stall(uint8_t ep_num) { m_regs->out_eps[ep_num].DOEPCTL |= USB_OTG_DOEPCTL_STALL; }
    inline void ep_out_clear_stall(uint8_t ep_num) { m_regs->out_eps[ep_num].DOEPCTL &= ~USB_OTG_DOEPCTL_STALL; }

    void set_dev_address(uint8_t address);
    inline void clear_dev_address() { m_regs->device.DCFG &= ~USB_OTG_DCFG_DAD; }
    inline void set_dev_addr_RAW(uint8_t addr) { m_regs->device.DCFG |= (addr << 4) & USB_OTG_DCFG_DAD; }

    inline void dev_connect() { m_regs->device.DCTL &= ~USB_OTG_DCTL_SDIS; STM32_SYSTICK::delay(3); }
    inline void dev_disconnect() { m_regs->device.DCTL |= USB_OTG_DCTL_SDIS; STM32_SYSTICK::delay(3); }

    void stop_device();
    inline void clear_shared_IT() { m_regs->device.DAINT = 0xffffffff; }
    inline void clear_in_IT() { m_regs->device.DIEPMSK = 0; }
    inline void clear_out_IT() { m_regs->device.DOEPMSK = 0; }

    void activate_setup();
    inline void reset_max_pkt_size() { m_regs->in_eps[0].DIEPCTL &= ~USB_OTG_DIEPCTL_MPSIZ; }
    inline void set_in_max_pkt_size(uint32_t max_size) { m_regs->in_eps[0].DIEPCTL |= max_size; }
    inline void clear_in_global_NAK() { m_regs->device.DCTL |= USB_OTG_DCTL_CGINAK; }

    void EP0_out_start(uint8_t dma, uint8_t* psetup);
    inline void ep_out_setup_packet_count() { m_regs->out_eps[0].DOEPTSIZ |= USB_OTG_DOEPTSIZ_STUPCNT; }
    inline void ep_out_start_enable() { m_regs->out_eps[0].DOEPCTL |= (USB_OTG_DOEPCTL_USBAEP | USB_OTG_DOEPCTL_EPENA); }

    inline EOTGDeviceMode get_mode() { return (EOTGDeviceMode)(m_regs->global.GINTSTS & 0x1); }
    inline uint32_t read_IT() { return m_regs->global.GINTSTS & m_regs->global.GINTMSK; }
    inline uint32_t read_dev_all_out_EP_IT() { return (((m_regs->device.DAINT & m_regs->device.DAINTMSK) & 0xffff0000) >> 16); }
    inline uint32_t read_dev_out_EP_IT(uint8_t ep_num) { return (m_regs->out_eps[ep_num].DOEPINT & m_regs->device.DOEPMSK); }
    inline uint32_t read_dev_all_in_EP_ITt() { return ((m_regs->device.DAINT & m_regs->device.DAINTMSK) & 0x0000ffff); }
    inline uint32_t read_dev_in_EP_IT(uint8_t ep_num) { return (m_regs->in_eps[ep_num].DIEPINT &
                                                                ((((m_regs->device.DIEPEMPMSK >> ep_num) & 1) << 7) |
                                                                 m_regs->device.DIEPMSK)); }
    inline void clear_IT(uint32_t interrupts) { m_regs->global.GINTSTS |= interrupts; }

    uint32_t core_reset();
    inline bool is_master_idle() { return ((m_regs->global.GRSTCTL & USB_OTG_GRSTCTL_AHBIDL) == USB_OTG_GRSTCTL_AHBIDL); }
    inline void core_soft_reset() { m_regs->global.GRSTCTL |= USB_OTG_GRSTCTL_CSRST; }
    inline bool is_core_reseted() { return ((m_regs->global.GRSTCTL & USB_OTG_GRSTCTL_CSRST) != USB_OTG_GRSTCTL_CSRST); }

    void host_init(EOTGSpeed speed, uint32_t host_channels, bool dma_enable);
    ENDIS_REG_FLAG_NAME(FS_LS_only, m_regs->host.HCFG, USB_OTG_HCFG_FSLSS)
    inline void set_RX_FIFO_size(uint32_t size) { m_regs->global.GRXFSIZ = size; }
    inline void set_RX_EP0_FIFO_size(uint32_t s0, uint32_t size) { m_regs->global.DIEPTXF0_HNPTXFSIZ = (((s0 << USB_OTG_NPTXFD_Pos) & USB_OTG_NPTXFD) | size); }
    inline void set_TX_FIFO_size(uint32_t s0, uint32_t s1) { m_regs->global.HPTXFSIZ = (((s0 << USB_OTG_HPTXFSIZ_PTXFD_Pos) & USB_OTG_HPTXFSIZ_PTXFD) | s1); }

    void init_FSLSPClk_sel(EClockSpeed freq);
    ENDIS_REG_FLAG_NAME(FS_LS_clock_sel, m_regs->host.HCFG, USB_OTG_HCFG_FSLSPCS)
    inline void set_FSLSPClk(uint32_t val) { m_regs->host.HFIR = val; }

    void drive_VBUS(uint8_t state);

    inline EOTGSpeed get_host_speed() { return (EOTGSpeed)((m_regs->HPRT0 & USB_OTG_HPRT_PSPD) >> USB_OTG_HPRT_PSPD_Pos); }

    void HC_start_Xfer(OTG_HC_t *hc, bool dma);
    inline uint32_t HC_get_Xfer_size(uint8_t ch_num) { return m_regs->channels[ch_num].HCTSIZ; }
    inline void HC_set_Xfer_size(uint8_t ch_num, uint32_t size, uint32_t numpkt, uint8_t PID)
        {
            m_regs->channels[ch_num].HCTSIZ = (size & USB_OTG_HCTSIZ_XFRSIZ) |
                    ((numpkt << USB_OTG_HCTSIZ_PKTCNT_Pos) & USB_OTG_HCTSIZ_PKTCNT) |
                    ((PID << USB_OTG_HCTSIZ_DPID_Pos) & USB_OTG_HCTSIZ_DPID);
        }
    inline void HC_set_Xfer_DMA(uint8_t ch_num, uint32_t size) { m_regs->channels[ch_num].HCDMA = size; }
    inline void enable_HC_odd_frame(uint8_t ch_num) { m_regs->channels[ch_num].HCCHAR |= USB_OTG_HCCHAR_ODDFRM; }
    inline void disable_HC_odd_frame(uint8_t ch_num) { m_regs->channels[ch_num].HCCHAR &= ~USB_OTG_HCCHAR_ODDFRM; }
    inline uint16_t get_TX_NP_FIFO_size() { return m_regs->global.HNPTXSTS & 0xffff; }
    inline uint16_t get_TX_NP_FIFO_hi_size() { return m_regs->global.HNPTXSTS & 0xff0000; }
    inline uint16_t get_TX_P_FIFO_size() { return m_regs->host.HPTXSTS & 0xffff; }

    inline uint32_t HC_read_IT() { return m_regs->host.HAINT & 0xffff; }

    void do_ping(uint8_t ch_num);
    inline void do_ping_LL(uint8_t ch_num)
        {
            m_regs->channels[ch_num].HCTSIZ = ((1 << USB_OTG_HCTSIZ_PKTCNT_Pos) & USB_OTG_HCTSIZ_PKTCNT) |
                    USB_OTG_HCTSIZ_DOPING;
        }
    void stop_host();

        inline void HC_reactivate(uint8_t ch_num)
        {
            uint32_t tmp = HC_get_params(ch_num);
            tmp &= ~USB_OTG_HCCHAR_CHDIS;
            tmp |= USB_OTG_HCCHAR_CHENA;
            HC_set_param_RAW(ch_num, tmp);
        }

    void port_IRQ_handler();
    void HC_in_IRQ_handler(uint8_t chnum);
    void HC_out_IRQ_handler(uint8_t chnum);
    void RXQLVL_IRQ_handler();
};

void connect_callback(STM32_HCD *hcd);
void disconnect_callback(STM32_HCD *hcd);
void SOF_callback(STM32_HCD *hcd);
void HC_notify_URB_change_callback(STM32_HCD *hcd, uint8_t ch_num, EURBState urb_state);

#ifdef STM32_USE_USB_FS
extern STM32_HCD usb_fs;
#endif

#ifdef STM32_USE_USB_HS
extern STM32_HCD usb_hs;
#endif

#endif
